import React from "react";

export default () => (
  <section
    className="section"
    style={{
      color: "#000",
      fontFamily: "Helvetica Neue, Helvetica, Arial, sans-serif",
      padding: "1rem",
    }}
  >
    <strong>Політика конфіденційності</strong>
    <p>
      Компанія Wrevery, LLC створила додаток кawa як безкоштовний додаток. Ця
      ПОСЛУГА надається Wrevery, LLC безкоштовно і призначена для використання
      "як є".
    </p>
    <p>
      Ця сторінка використовується для інформування відвідувачів про нашу
      політику відносно збору, використання і розкриття особистої інформації,
      якщо хто-небудь вирішив використати наш сервіс.
    </p>
    <p>
      Якщо ви вирішите використати наш сервіс, ви погоджуєтеся на збір і
      використання інформації відносно цієї політики. Особиста інформація, яку
      ми збираємо, використовується для надання і поліпшення Сервісу. Ми не
      використовуватимемо або не передаватимемо вашу інформацію кому-небудь,
      окрім випадків, описаних в цій Політиці конфіденційності.
    </p>
    <p>
      Терміни, які використовуються в данній політиці конфіденційності, мають те
      ж значення, що і в наших Положеннях і умовах, які доступні на сайті кawa,
      якщо інше не визначене в данній Політиці конфіденційності.
    </p>
    <p>
      <strong id="delete-data">
        Збір, використання та видалення інформації
      </strong>
    </p>
    <p>
      Для зручного використання нашого сервісу ми можемо вимагати від Вас надати
      нам певну особисту інформацію, включаючи, окрім іншого, повне ім'я, адресу
      електронної пошти, номер телефону, домашню адресу, стать, дату народження,
      IP- адресу. Інформація, яку ми просимо, зберігатиметься нами і буде
      використовуватися, як описано в цій політиці конфіденційності.
    </p>
    <div>
      <p>
        Додаток використовує сторонні сервіси, які можуть збирати інформацію,
        для використання вашої ідентифікації.
      </p>
      <p>
        Посилання на політику конфіденційності інших постачальників послуг, які
        використовуються додатком:
      </p>
      <ul>
        <li>
          <a
            href="https://www.google.com/policies/privacy/"
            target="_blank"
            rel="noopener noreferrer"
          >
            Google Play Services
          </a>
        </li>

        <li>
          <a
            href="https://www.facebook.com/privacy/explanation"
            target="_blank"
            rel="noopener noreferrer"
          >
            Facebook
          </a>
        </li>
      </ul>
      <p>
        Доступ, Виправлення і Вилучення: користувачі, які створили обліковий
        запис, можуть отримувати доступ, виправляти або видаляти інформацію, яку
        вони надають, безпосередньо у додатку KAWA. Користувач несе
        відповідальність за точність наданих даних у додатку KAWA.
      </p>
      <p>
        Якщо обліковий запис користувача був створений через провайдера
        ідентифікації (наприклад, Facebook Connect), користувач може також
        відключити, видалити або змінити дані облікового запису надіславши
        письмову заяву на адресу компанії info@kawa.app, яка повинна мати e-mail
        - ідентіфікатор користувача у дадатку KAWA, який потрібно обробити.
        Отримавши таку заяву, компанія на адресу електроної пошти, яка зазначена
        як ідентіфікатор користувача, надсилає уточнюючий запит на виконання
        зміни або видалення даних. Користувач з цієї адреси повинен підтвердити
        зворотнім листом зміни до облікового запису. Виконавши вимоги
        користувача, компанія надсилає користувачу повідомлення про зміну,
        припинення або видалення персональних даних наведених у заяві у термін 2
        робочих дні.
      </p>
    </div>
    <p>
      <strong>Дані журналу</strong>
    </p>
    <p>
      Ми хочемо повідомити Вас, що кожен раз, коли ви використовуєте нашу
      Службу, у разі помилки в додатку ми збираємо дані і інформацію (через
      сторонні продукти) на вашому телефоні, що називаються даними журналу. Ці
      дані журналу можуть включати таку інформацію, як IP- адреса вашого
      пристрою, ім'я пристрою, версія операційної системи, конфігурація додатка
      при використанні нашого Сервісу, час і дата використання вами Сервісу і
      інші статистичні дані.
    </p>
    <p>
      <strong>Файли cookie</strong>
    </p>
    <p>
      Файли cookie - це файли з невеликим об'ємом даних, які зазвичай
      використовуються як анонімні унікальні ідентифікатори. Вони відправляються
      у ваш браузер з веб-сайтів, які ви відвідуєте, і зберігаються у внутрішній
      пам'яті вашого пристрою.
    </p>
    <p>
      Цей Сервіс не використовує ці "cookie" явно. Проте додаток може
      використати сторонній код і бібліотеки, які використовують файли cookie
      для збору інформації і поліпшення своїх послуг. У вас є можливість
      прийняти або відхилити ці файли cookie і дізнатися, коли файл cookie
      вирушає на ваш пристрій. Якщо ви вирішите відмовитися від наших файлів
      cookie, можливо, ви не зможете використати деякі частини цієї Послуги.
    </p>
    <p>
      <strong>Постачальники послуг</strong>
    </p>
    <p>
      Ми можемо наймати сторонні компанії і приватних осіб з наступних причин:
    </p>
    <ul>
      <li>Для полегшення нашого Сервісу;</li>
      <li>Для надання Сервісу від нашого імені;</li>
      <li>Для надання послуг, пов'язаних з Сервісом;</li>
      <li>Щоб допомогти нам в аналізі використання нашого Сервісу.</li>
    </ul>
    <p>
      Ми хочемо проінформувати користувачів цього Сервісу про те, що ці треті
      сторони мають доступ до вашої Особистої інформації. Для того, щоб
      виконувати поставлені перед ними завдання від нашого імені. Проте вони
      зобов'язані не розкривати і не використовувати інформацію для будь-яких
      інших цілей.
    </p>
    <p>
      <strong>Безпека</strong>
    </p>
    <p>
      Ми цінуємо Вашу довіру до надання нам Вашої особистої інформації, тому ми
      прагнемо використати комерційно прийнятні засоби для її захисту. Але
      пам'ятаєте, що жоден метод передачі через Інтернет або метод електронного
      зберігання не є на 100% безпечним і надійним, і ми не можемо гарантувати
      його абсолютну безпеку.
    </p>
    <p>
      <strong>Посилання на інші сайти</strong>
    </p>
    <p>
      Цей Сервіс може мати посилання на інші сайти. Якщо ви натиснете на
      стороннє посилання, ви будете перенаправлені на цей сайт. Зверніть увагу,
      що ці зовнішні сайти не керуються нами. Тому ми рекомендуємо вам
      ознайомитися з Політикою конфіденційності цих веб-сайтів. Ми не
      контролюємо і не несемо відповідальності за контент, політику
      конфіденційності або дії будь-яких сторонніх сайтів або служб.
    </p>
    <p>
      <strong>Конфіденційність дітей</strong>
    </p>
    <p>
      Ці послуги не призначені для осіб молодше 13 років. Ми свідомо не збираємо
      особисту інформацію від дітей молодше 13 років. У разі, якщо ми виявляємо,
      що дитина молодше 13 років надала нам особисту інформацію, ми негайно
      видаляємо її з наших серверів. Якщо ви є одним з батьків або опікуном і
      знаєте, що ваша дитина надала нам особисту інформацію, зв'яжіться з нами,
      щоб ми змогли зробити необхідні дії.
    </p>
    <p>
      <strong>Зміни в данній Політиці конфіденційності</strong>
    </p>
    <p>
      Ми можемо час від часу оновлювати нашу Політику конфіденційності. Таким
      чином, вам рекомендується періодично переглядати цю сторінку на предмет
      змін. Ми повідомимо вас про будь-які зміни, розмістивши нову Політику
      конфіденційності на цій сторінці
    </p>
    <p>Ця політика діє з 1 січня 2021 року.</p>
    <p>
      Якщо у вас є які-небудь питання або пропозиції з приводу нашої Політики
      конфіденційності, не соромтеся звертатися до нас за адресою info@kawa.app.
    </p>
  </section>
);
