import React from "react";

export default () => (
  <section className="section" style={{ color: "#000" }}>
    <strong>Умови та положення</strong>
    <p>
      При завантаженні або використанні додатка ці умови автоматично застосовуватимуться до вас - тому ви повинні уважно
      прочитати їх перед використанням додатка. Вам не дозволяється копіювати або змінювати додаток, будь-яку його
      частину або наші торгові марки яким-небудь чином. Вам не дозволяється намагатися витягнути початковий код додатку,
      і вам також не слід намагатися перекладати додаток іншими мовами або створювати похідні версії. Саме застосування
      і усі торгові марки, авторські права, права на бази даних і інші права інтелектуальної власності, пов'язані з ним,
      як і раніше належать Wrevery, LLC.{" "}
    </p>
    <p>
      Компанія Wrevery, LLC прагне до того, щоб додаток був максимально корисним і ефективним. З цієї причини ми
      залишаємо за собою право вносити зміни в додаток або стягувати плату за його послуги у будь-який час і з будь-якої
      причини. Ми ніколи не стягуватимемо з вас плату за додаток або його послуги, якщо вам не ясно, за що саме ви
      платите.
    </p>
    <p>
      Додаток кawa зберігає і оброблює особисті дані, які ви нам надали, для надання наших Послуг. Ви несете
      відповідальність за безпеку свого телефону і доступу до додатку. Тому ми рекомендуємо вам не робити джейлбрейк або
      рутирувати телефон, оскільки це процес зняття програмних обмежень, обмежень, що накладаються офіційною операційною
      системою вашого пристрою. Це може зробити ваш телефон уразливим для вірусів / шкідливих програм, поставити під
      загрозу функції безпеки вашого телефону, а також може означати, що додаток кawa не працюватиме належним чином або
      взагалі не працюватиме.
    </p>
    <div>
      <p>Додаток використовує сторонні сервіси, які декларують свої власні Умови використання.</p>
      <p>Посилання на Умови використання сторонніх постачальників послуг, використовуваних додатком:</p>
      <ul>
        <li>
          <a href="https://policies.google.com/terms" target="_blank" rel="noopener noreferrer">
            Google Play Services
          </a>
        </li>
      </ul>
    </div>
    <p>
      Ви повинні знати, що є певні речі, за які Wrevery, LLC не несе відповідальності. Для деяких функцій додатку
      знадобиться, щоб у додатку було активне підключення до Інтернету. З'єднання може бути Wi - Fi або надано вашим
      провайдером мобільної мережі, але Wrevery, LLC не може нести відповідальність за те, що додаток не працює з повною
      функціональністю, якщо у вас немає доступу до Wi - Fi, або закінчився ліміт від мобільної мережі.
    </p>
    <p></p>
    <p>
      Якщо ви використовуєте додаток за межами зони дії Wi - Fi, пам'ятайте, що умови угоди з вашим оператором
      мобільного зв'язку як і раніше діятимуть. В результаті ваш оператор мобільного зв'язку може стягувати з вас плату
      за передачу даних впродовж усього часу з'єднання при доступі до додатку або інші збори третіх осіб. Використовуючи
      додаток, ви переймаєте на себе відповідальність за будь-які такі витрати, включаючи плату за передачу даних в
      роумінгу, якщо ви використовуєте додаток за межами своєї рідної території (тобто. Регіону або країни) без
      відключення роумінгу даних. Якщо ви не є платником рахунків для пристрою, на якому ви використовуєте додаток,
      майте на увазі, що ми припускаємо, що ви отримали дозвіл від платника рахунків на використання додатку.
    </p>
    <p>
      Що стосується відповідальності Wrevery, LLC за використання вами додатка. Коли ви використовуєте додаток, важливо
      пам'ятати, що, хоч ми і прагнемо забезпечити його постійне оновлення і виправлення, ми покладаємося на третіх осіб
      які нададуть нам інформацію, щоб ми могли зробити її доступною для вас. Wrevery, LLC не несе відповідальності за
      будь-які збитки, прямі або непрямі, які ви понесли в результаті того, що повністю покладалися на цю
      функціональність додатку.
    </p>
    <p>
      У якийсь момент ми можемо захотіти оновити додаток. Нині додаток доступний для Android - вимоги до системи (і до
      будь-яких додаткових систем, для яких ми вирішили розширити доступність додатка) можуть змінитися, і вам треба
      буде завантажити оновлення, якщо ви хочете продовжувати використовувати додаток. Wrevery, LLC не обіцяє, що завжди
      оновлюватиме додаток, щоб він був актуальним для вас і / або працював з версією Android, встановленою на вашому
      пристрої. Проте ви обіцяєте завжди приймати оновлення додатка, коли вони пропонуються вам. Ми також можемо
      захотіти припинити надання додатку і можемо припинити його використання у будь-який час, не повідомляючи вас про
      припинення дії. Якщо ми не повідомимо вам інше, при будь-якому розірванні: (а) права і ліцензії, надані вам
      відповідно до справжніх умов, припиняться; (б) ви повинні припинити використання додатку і (при необхідності)
      видалити його зі свого пристрою.
    </p>
    <p>
      <strong>Зміни в справжніх Умовах використання</strong>
    </p>
    <p>
      Ми можемо час від часу оновлювати наші Умови. Таким чином, вам рекомендується періодично переглядати цю сторінку
      на предмет змін. Ми повідомимо вас про будь-які зміни, розмістивши нові Умови використання на цій сторінці.
    </p>
    <p>Ці умови діють з 1 січня 2021 року.</p>
    <p>
      <strong>Зв'язатися з нами</strong>
    </p>
    <p>
      Якщо у вас є які-небудь питання або пропозиції відносно наших Положень і умов, не соромтеся звертатися до нас за
      адресою info@kawa.app
    </p>
  </section>
);
