import React from "react";

export default () => (
  <section
    className="section"
    style={{
      color: "#000",
      fontFamily: "Helvetica Neue, Helvetica, Arial, sans-serif",
      padding: "1rem",
    }}
  >
    <strong>Политика конфиденциальности</strong>
    <p>
      Компания Wrevery, LLC создала приложение кawa как бесплатное приложение.
      Данная УСЛУГА предоставляется Wrevery, LLC бесплатно и предназначена для
      использования «как есть».
    </p>
    <p>
      Эта страница используется для информирования посетителей о нашей политике
      в отношении сбора, использования и раскрытия личной информации, если
      кто-либо решил использовать наш сервис.
    </p>
    <p>
      Если вы решите использовать наш сервис, вы соглашаетесь на сбор и
      использование информации в отношении этой политики. Личная информация,
      которую мы собираем, используется для предоставления и улучшения Сервиса.
      Мы не будем использовать или передавать вашу информацию кому-либо, кроме
      случаев, описанных в настоящей Политике конфиденциальности.
    </p>
    <p>
      Термины, используемые в настоящей политике конфиденциальности, имеют то же
      значение, что и в наших Положениях и условиях, которые доступны на сайте
      кawa, если иное не определено в настоящей Политике конфиденциальности.
    </p>
    <p>
      <strong id="delete-data">
        Сбор, использование и удаление информации
      </strong>
    </p>
    <p>
      Для удобного использования нашего сервиса мы можем потребовать от Вас
      предоставить нам определенную личную информацию, включая, помимо прочего,
      полное имя, адрес электронной почты, номер телефона, домашний адрес, пол,
      дату рождения, IP-адрес. Информация, которую мы запрашиваем, будет
      храниться нами и использоваться, как описано в этой политике
      конфиденциальности.
    </p>
    <div>
      <p>
        Приложение использует сторонние сервисы, которые могут собирать
        информацию, используемую для вашей идентификации.
      </p>
      <p>
        Ссылка на политику конфиденциальности других поставщиков услуг,
        используемых приложением.
      </p>
      <ul>
        <li>
          <a
            href="https://www.google.com/policies/privacy/"
            target="_blank"
            rel="noopener noreferrer"
          >
            Google Play Services
          </a>
        </li>

        <li>
          <a
            href="https://www.facebook.com/privacy/explanation"
            target="_blank"
            rel="noopener noreferrer"
          >
            Facebook
          </a>
        </li>
      </ul>
      <p>
        Доступ, Исправление и Удаление: пользователи, которые создали учетную
        запись, могут получать доступ, исправлять или удалять информацию,
        которую они предоставляют, непосредственно в приложении KAWA.
        Пользователь несет ответственность за точность предоставленных данных в
        приложении KAWA.
      </p>
      <p>
        Если учетная запись пользователя была создана через провайдера
        идентификации (например, Facebook Connect), пользователь может также
        отключить, удалить или изменить данные учетной записи, послав письменное
        заявление на адрес компании info@kawa.app. В письме должен содержаться e
        - mail - ідентіфікатор пользователя в приложении KAWA, который нужно
        обработать. Получив такое заявление, компания на адрес електроної почты,
        которая отмечена как идентификатор пользователя, посылает уточняющий
        запрос на выполнение изменения или удаления данных. Пользователь со
        своего адреса должен подтвердить обратным письмом изменения к учетной
        записи. Выполнив требования пользователя, компания посылает пользователю
        сообщения об изменении, прекращении или удалении персональных данных
        приведенных в заявлении в срок 2 рабочих дня.
      </p>
    </div>
    <p>
      <strong>Данные журнала</strong>
    </p>
    <p>
      Мы хотим сообщить Вам, что всякий раз, когда вы используете нашу Службу, в
      случае ошибки в приложении мы собираем данные и информацию (через
      сторонние продукты) на вашем телефоне, называемые данными журнала. Эти
      данные журнала могут включать такую информацию, как IP-адрес вашего
      устройства, имя устройства, версия операционной системы, конфигурация
      приложения при использовании нашего Сервиса, время и дата использования
      вами Сервиса и другие статистические данные.
    </p>
    <p>
      <strong>Файлы cookies</strong>
    </p>
    <p>
      Файлы cookie - это файлы с небольшим объемом данных, которые обычно
      используются в качестве анонимных уникальных идентификаторов. Они
      отправляются в ваш браузер с веб-сайтов, которые вы посещаете, и хранятся
      во внутренней памяти вашего устройства.
    </p>
    <p>
      Этот Сервис не использует эти «cookie» явно. Однако приложение может
      использовать сторонний код и библиотеки, которые используют файлы cookie
      для сбора информации и улучшения своих услуг. У вас есть возможность
      принять или отклонить эти файлы cookie и узнать, когда файл cookie
      отправляется на ваше устройство. Если вы решите отказаться от наших файлов
      cookie, возможно, вы не сможете использовать некоторые части этой Услуги.
    </p>
    <p>
      <strong>Поставщики услуг</strong>
    </p>
    <p>
      Мы можем нанимать сторонние компании и частных лиц по следующим причинам:
    </p>
    <ul>
      <li>To facilitate our Service;</li>
      <li>Для предоставления Сервиса от нашего имени;</li>
      <li>Для оказания услуг, связанных с Сервисом; </li>
      <li>Чтобы помочь нам в анализе использования нашего Сервиса.</li>
    </ul>
    <p>
      Мы хотим проинформировать пользователей этого Сервиса о том, что эти
      третьи стороны имеют доступ к вашей Личной информации. Для того, чтобы
      выполнять поставленные перед ними задачи от нашего имени. Однако они
      обязаны не раскрывать и не использовать информацию для каких-либо других
      целей.
    </p>
    <p>
      <strong>Безопасность</strong>
    </p>
    <p>
      Мы ценим Ваше доверие к предоставлению нам Вашей личной информации,
      поэтому мы стремимся использовать коммерчески приемлемые средства для ее
      защиты. Но помните, что ни один метод передачи через Интернет или метод
      электронного хранения не является на 100% безопасным и надежным, и мы не
      можем гарантировать его абсолютную безопасность.
    </p>
    <p>
      <strong>Ссылки на другие сайты</strong>
    </p>
    <p>
      Этот Сервис может содержать ссылки на другие сайты. Если вы нажмете на
      стороннюю ссылку, вы будете перенаправлены на этот сайт. Обратите
      внимание, что эти внешние сайты не управляются нами. Поэтому мы
      настоятельно рекомендуем вам ознакомиться с Политикой конфиденциальности
      этих веб-сайтов. Мы не контролируем и не несем ответственности за контент,
      политику конфиденциальности или действия любых сторонних сайтов или служб.
    </p>
    <p>
      <strong>Конфиденциальность детей</strong>
    </p>
    <p>
      Эти услуги не предназначены для лиц младше 13 лет. Мы сознательно не
      собираем личную информацию от детей младше 13 лет. В случае, если мы
      обнаруживаем, что ребенок младше 13 лет предоставил нам личную информацию,
      мы немедленно удаляем ее с наших серверов. Если вы являетесь родителем или
      опекуном и знаете, что ваш ребенок предоставил нам личную информацию,
      свяжитесь с нами, чтобы мы смогли предпринять необходимые действия.
    </p>
    <p>
      <strong>Изменения в настоящей Политике конфиденциальности</strong>
    </p>
    <p>
      Мы можем время от времени обновлять нашу Политику конфиденциальности.
      Таким образом, вам рекомендуется периодически просматривать эту страницу
      на предмет изменений. Мы уведомим вас о любых изменениях, разместив новую
      Политику конфиденциальности на этой странице.
    </p>
    <p>Эта политика действует с 1 января 2021 года.</p>
    <p>
      <strong>Свяжитесь с нами</strong>
    </p>
    <p>
      Если у вас есть какие-либо вопросы или предложения по поводу нашей
      Политики конфиденциальности, не стесняйтесь обращаться к нам по адресу
      info@kawa.app{" "}
    </p>
  </section>
);
