import React from "react";

export default () => (
  <section className="section" style={{ color: "#000" }}>
    <strong>Условия и положения</strong>
    <p>
      При загрузке или использовании приложения эти условия будут автоматически применяться к вам - поэтому вы должны
      внимательно прочитать их перед использованием приложения. Вам не разрешается копировать или изменять приложение,
      любую его часть или наши торговые марки каким-либо образом. Вам не разрешается пытаться извлечь исходный код
      приложения, и вам также не следует пытаться переводить приложение на другие языки или создавать производные
      версии. Само приложение и все торговые марки, авторские права, права на базы данных и другие права
      интеллектуальной собственности, связанные с ним, по-прежнему принадлежат Wrevery, LLC.
    </p>
    <p>
      Компания Wrevery, LLC стремится к тому, чтобы приложение было максимально полезным и эффективным. По этой причине
      мы оставляем за собой право вносить изменения в приложение или взимать плату за его услуги в любое время и по
      любой причине. Мы никогда не будем взимать с вас плату за приложение или его услуги, если вам не ясно, за что
      именно вы платите.
    </p>
    <p>
      Приложение кawa хранит и обрабатывает личные данные, которые вы нам предоставили, для предоставления наших Услуг.
      Вы несете ответственность за безопасность своего телефона и доступа к приложению. Поэтому мы рекомендуем вам не
      делать джейлбрейк или рутировать телефон, поскольку это процесс снятия программных ограничений, ограничений,
      налагаемых официальной операционной системой вашего устройства. Это может сделать ваш телефон уязвимым для вирусов
      / вредоносных программ, поставить под угрозу функции безопасности вашего телефона, а также может означать, что
      приложение кawa не будет работать должным образом или вообще не будет работать.
    </p>
    <div>
      <p>Приложение использует сторонние сервисы, которые декларируют свои собственные Условия использования.</p>
      <p>Ссылка на Условия использования сторонних поставщиков услуг, используемых приложением:</p>
      <ul>
        <li>
          <a href="https://policies.google.com/terms" target="_blank" rel="noopener noreferrer">
            Google Play Services
          </a>
        </li>
      </ul>
    </div>
    <p>
      Вы должны знать, что есть определенные вещи, за которые Wrevery, LLC не несет ответственности. Для некоторых
      функций приложения потребуется, чтобы у приложения было активное подключение к Интернету. Соединение может быть
      Wi-Fi или предоставлено вашим провайдером мобильной сети, но Wrevery, LLC не может нести ответственность за то,
      что приложение не работает с полной функциональностью, если у вас нет доступа к Wi-Fi, или закончился лимит от
      мобильной сети.
    </p>
    <p></p>
    <p>
      Если вы используете приложение за пределами зоны действия Wi-Fi, помните, что условия соглашения с вашим
      оператором мобильной связи по-прежнему будут действовать. В результате ваш оператор мобильной связи может взимать
      с вас плату за передачу данных в течение всего времени соединения при доступе к приложению или другие сборы
      третьих лиц. Используя приложение, вы принимаете на себя ответственность за любые такие расходы, включая плату за
      передачу данных в роуминге, если вы используете приложение за пределами своей родной территории (т.е. Региона или
      страны) без отключения роуминга данных. Если вы не являетесь плательщиком счетов для устройства, на котором вы
      используете приложение, имейте в виду, что мы предполагаем, что вы получили разрешение от плательщика счетов на
      использование приложения.
    </p>
    <p>
      Что касается ответственности Wrevery, LLC за использование вами приложения. Когда вы используете приложение, важно
      помнить, что, хоть мы стремимся обеспечить его постоянное обновление и исправление, мы полагаемся на третьих лиц
      которые предоставят нам информацию, чтобы мы могли сделать ее доступной для вас. Wrevery, LLC не несет
      ответственности за любые убытки, прямые или косвенные, которые вы понесли в результате того, что полностью
      полагались на эту функциональность приложения.{" "}
    </p>

    <p>
      {" "}
      В какой-то момент мы можем захотеть обновить приложение. В настоящее время приложение доступно для Android -
      требования к системе (и к любым дополнительным системам, для которых мы решили расширить доступность приложения)
      могут измениться, и вам нужно будет загрузить обновления, если вы хотите продолжать использовать приложение.
    </p>

    <p>
      Wrevery, LLC не обещает, что всегда будет обновлять приложение, чтобы оно было актуальным для вас и / или работало
      с версией Android, установленной на вашем устройстве. Однако вы обещаете всегда принимать обновления приложения,
      когда они предлагаются вам. Мы также можем пожелать прекратить предоставление приложения и можем прекратить его
      использование в любое время, не уведомляя вас о прекращении действия. Если мы не сообщим вам иное, при любом
      расторжении: (а) права и лицензии, предоставленные вам в соответствии с настоящими условиями, прекратятся; (б) вы
      должны прекратить использование приложения и (при необходимости) удалить его со своего устройства.
    </p>
    <p>
      <strong>Изменения в настоящих Условиях использования</strong>
    </p>
    <p>
      Мы можем время от времени обновлять наши Условия. Таким образом, вам рекомендуется периодически просматривать эту
      страницу на предмет изменений. Мы сообщим вам о любых изменениях, разместив новые Условия использования на этой
      странице.
    </p>
    <p>Эти условия действуют с 1 января 2021 года.</p>
    <p>
      <strong>Связаться с нами</strong>
    </p>
    <p>
      Если у вас есть какие-либо вопросы или предложения относительно наших Положений и условий, не стесняйтесь
      обращаться к нам по адресу info@kawa.app
    </p>
  </section>
);
